<?php
if (!defined('ABSPATH')) exit;
class gzseo_comment
{
    public $default_comments;
    public function __construct() {
        $this->default_comments = [
            "سلام وقتتون بخیر باشه \n موافقم با مطلب ولی درمورد {gzseo_replace} لطفا بیشتر توضیح بدین",
            "
            سلام مرسی بابت توضیحات
            \n
            فقط یه چیزی
            \n
            من یه سوال داشتم شما صفحه ای در مورد {gzseo_replace} هم دارید؟
            ","من مطلبتون رو مطالعه کردم ولی نیاز دارم در مورد {gzseo_replace} هم مطالعه کنم ممنون میشم یا همینجا بهم بگید یا اگر مطلبی در موردش دارید راهنماییم کنید تا مطالعه کنم
            ","
            سلام. من مدت‌هاست که به دنبال اطلاعات کامل‌تری در زمینه {gzseo_replace} هستم و خوشحالم که بخشی از نیازم رو در سایت شما پیدا کردم. با این حال، هنوز سوالات زیادی در ذهنم باقی مونده. اگر امکانش هست، لطفاً منابع یا اطلاعات بیشتری در این خصوص ارائه بدید. همچنین اگر مطلبی تخصصی در ارتباط با {gzseo_replace} دارید، خوشحال می‌شم که لینک اون رو به اشتراک بذارید. از وقتی که برای پاسخ به این سوالات می‌گذارید، بی‌نهایت سپاسگزارم.
            ","
            در حال حاضر من درباره {gzseo_replace} سوال دارم و امیدوارم بتونم اطلاعات بیشتری در این زمینه به دست بیارم. اگر امکان داره، توضیحات بیشتری در مورد {gzseo_replace} ارائه کنید و یا اگر منبعی دارید که می‌تونم بهش مراجعه کنم، لطفاً معرفی کنید. همچنین هر گونه راهنمایی یا نکته‌ای که در این زمینه دارید، بسیار برای من مفید خواهد بود.
            ","
            سلام رفقا! دستتون درد نکنه بابت این مطلب خفن. من راستش دارم تو زمینه {gzseo_replace} تحقیق می‌کنم و مطلب شما خیلی کمکم کرد. فقط اگه میشه یه کم بیشتر در مورد {gzseo_replace} توضیح بدید یا اگه مطلبی دارید که بشه توش اطلاعات بیشتری پیدا کرد، لینکش رو بهم بدید. مرسی از شما.
            ","
            مطلب شما رو با دقت مطالعه کردم و مطالب بسیار مفیدی در اون پیدا کردم. من به تازگی به موضوع {gzseo_replace} علاقه‌مند شدم و به دنبال اطلاعات بیشتری در این باره هستم. اگر امکانش هست، لطفاً منابعی که در این زمینه مفید هستن رو معرفی کنید. همچنین اگر تجربه یا نکته خاصی در مورد {gzseo_replace} دارید که می‌تونه به من کمک کنه، بسیار ممنون می‌شم که اون رو به اشتراک بذارید. سپاس
            ","
            سلام دوستان عزیز! اول از همه بگم که مقاله‌تون واقعاً فوق‌العاده بود. دست مریزاد بهتون. من الان یه مدت هست که دارم درباره موضوع {gzseo_replace} تحقیق می‌کنم و راستش مقاله شما خیلی به دردم خورد. اطلاعاتی که ارائه دادید، خیلی دقیق و کاربردی بودن. فقط یه سوالی که دارم اینه که اگه میشه یه کم بیشتر در مورد {gzseo_replace} توضیح بدید. مثلا اینکه چه منابع دیگه‌ای وجود داره که بشه ازشون اطلاعات بیشتری کسب کرد؟ یا اگه مقاله یا کتابی در این زمینه هست که شما پیشنهاد می‌دید، ممنون می‌شم بهم معرفی کنید. همچنین، اگه تجربیات شخصی یا نکته‌های خاصی دارید که می‌تونن توی این زمینه کمک‌کننده باشن، خیلی خوشحال می‌شم که با من به اشتراک بذارید. بازم ممنون از وقتی که برای نوشتن این مقاله گذاشتید و امیدوارم که همچنان موفق باشید.
            ","
            مطلبتون واقعاً عالی بود. اگه امکانش هست، لطفاً یه کم بیشتر در مورد {gzseo_replace} توضیح بدید. مثلا اینکه چه منابع دیگه‌ای رو می‌تونم مطالعه کنم یا اگه مقاله یا کتاب خاصی هست…"
        ];

    }

    public function add_meta_box(){
        if(gzseo_gsc::status()=='OK'){
            add_meta_box( 'gzseo_comment', 'کامنت های پیشفرض جی زد سئو', [$this , 'view_metabox'] );
        }
    }

    public function view_metabox(){
        include(GZSEO_VIEWS_DIR.'metaboxes/comment/comment.php');
        return 'sdfdfgdf';
    }

    public function get_comments(){
        $default_comments = $this->default_comments;
        $get_user_comments = $this->get_user_comments();
         $comments = array_merge($default_comments,$get_user_comments);
        return $comments;
    }
    //add_action('wp_ajax_gzseo_add_comment', 'gzseo_add_comment_callback');

    // Handle the AJAX request to add the comment
    public function add_comment() {
        check_ajax_referer('gzseo_add_comment_nonce', 'gzseo_add_comment_nonce');
        //$nonce = (wp_verify_nonce( 'gzseo_add_comment_nonce', 'gzseo_add_comment' ));
        //if(!$nonce)  wp_send_json_error();
        if (empty($_POST['post_id'])) wp_send_json_error();
        if (empty($_POST['thispage'])) wp_send_json_error();
        if (empty($_POST['comment'])) wp_send_json_error();
        if (empty($_POST['keyword'])) wp_send_json_error();
        $post_id = intval($_POST['post_id']);
        $thispage = intval($_POST['thispage']);

        $comment = sanitize_textarea_field(wp_unslash($_POST['comment']));
        $keyword = sanitize_textarea_field(wp_unslash($_POST['keyword']));
        // //$comment = (sanitize_textarea_field($comment));
        // $keyword = wp_unslash($_POST['keyword']);
        // $keyword = (sanitize_textarea_field($keyword));
        

        if ($post_id!=$thispage) {
            $keyword = '<a href="'.get_permalink($thispage).'">'.$keyword.'</a>';
        }

        $comment = str_replace("{gzseo_replace}",$keyword,$comment);
        $name = $this->generatename();

        $comment_data = [
            'comment_post_ID' => $post_id,
            'comment_content' => $comment,
            'comment_approved' => 1,
            'comment_author' => $name,
            'comment_meta'         => [
                'gzseo_generated_by' => 'user',
                ]
        ];

        if (wp_insert_comment($comment_data)) {
            wp_send_json_success();
        } else {
            wp_send_json_error();
        }
    }

    public static function generatename(){
        $firstName = ["آبتین","آتیلا","آراد","آرام","آران","آرتان","آرتین","آرش","آرمان","آرمین","آرون","آریا","آریابد","آریامنش","آریان","آریانا","آریوبرزن","آزاد","آصف","آوند","آیدین","ابراهیم","احد","احسان","احمد","ادریس","ارجان","ارجمند","اردشیر","اردلان","ارستو","ارسلان","ارسیا","ارشام","ارشیا","ارمیا","اسد","اسفندیار","اسفندیار","اسلان","اسماعیل","اشکان","اصغر","افراسیاب","افشار","افشین","اقبال","اکبر","البرز","الوند","الیا","الیاس","امجد","امید","امیر","امین","انوش","انوشیروان","ایرج","ایرمان","ایزد","ایلا","ایمان","بابک","باران","باربد","بارمان","بامداد","بختیار","بردیا","برزو","برزویه","برزین","برسام","برمک","بزرگمهر","بشیر","بهادر","بهار","بهامین","بهبود","بهداد","بهدین","بهرام","بهرخ","بهرنگ","بهروز","بهزاد","بهمن","بهنام","بیژن","بینا","پارسا","پاشا","پدرام","پردیس","پرشین","پرهام","پرویز","پژمان","پُژمان","پژواک","پورنگ","پوریا","پولاد","پویا","پویان","پیام","پیدافر","پیروز","پیمان","تابال","تاج","تراب","تهماسب","تورج","تیرداد","تیرنام","تیمور","جاوید","جعفر","جلال","جمال","جمشید","جهان","جهانبخت","جهاندار","جهانشیر","جهانگیر","جهانمهر","جهانیار","جواد","چاووش","چنگیز","حافظ","حامد","حامی","حانی","حبیب","حسام","حسن","حسین","حمید","حیدر","خرداد","خرسند","خسرو","خشایار","دادفر","دادمهر","دارا","داراب","دارمان","داریا","داریان","داریوش","دامون","دانا","دانش","دانوش","دانیال","داور","داوود","دریا دل","دلاور","دلیر","دولت","دیاکو","رادبد","رادمان","رادمنش","رادمهر","رادین","رامبُد","رامتین","رامی","رامیاد","رامیار","رامین","رایان","رایکا","رحیم","رخشان","رزین","رسام","رستم","رسول","رشید","رضا","رها","رهاد","روشان","زادمهر","زامیاد","زاهد","زکریا","سارنگ","ساسان","ساعد","سالار","سام","سامان","سامی","سامیار","سامین","ساویز","سپنتا","سپنتمان","سپند","سپندار","سپهر","ستوده","سردار","سرمند","سرواد","سروش","سریر","سعید","سلمان","سلیم","سلیمان","سمراد","سمند","سمیر","سهراب","سهند","سهیل","سورنا","سیاوش","سیرمان","سیروس","سینا","سینام","سیوا","شاپور","شادان","شادرخ","شادروز","شادمهر","شادورد","شاهد","شاهرخ","شاهور","شاهین","شجاع","شروین","شریف","شهاب","شهباز","شهداد","شهراب","شهراد","شهرام","شهرداد","شهروز","شهریار","شهیار","شیرزاد","شیروان","صابر","صادق","صبا","صدری","صدیق","صلاح","صمد","ضیا","طوس","طوفان","ظفر","عادل","عارف","عبّاس","عزیز","عطا","علی","علی داد","عماد","عنایت","غدیر","فاضل","فراز","فرازمان","فرامرز","فرامین","فربد","فرج","فرّخ","فرخاد","فرّخزاد","فردیس","فردین","فرزین","فرساد","فرشاد","فرشید","فرنام","فرهاد","فرهان","فرهد","فرهنگ","فرود","فروَد","فرورتیش","فروردین","فروهر","فریبرز","فرید","فریدون","فریمان","فرینام","فیروز","قادر","قاسم","قباد","قدرت","قلندر","قیصر","کارن","کاظم","کامبخش","کامبیز","کامبین","کامدین","کامران","کامیار","کاوه","کاووس","کاویان","کریم","کمال","کوشا","کوشان","کوشیار","کیارش","کیا","کیان","کیاوش","کیهان","کیوان","کیومرث","گرشاسب","مازار","مازیار","ماکان","مانی","ماهان","متین","مجتبی","مجید","محسن","محمّد","محمود","مراد","مرتضی","مروان","مزدا","مسعود","مصطفی","معین","مقصود","منصور","منوچهر","مهبد","مهداد","مهدی","مهرا","مهراب","مهراد","مهرام","مهرام","مهران","مهربان","مهرداد","مهرزاد","مهرگان","مهرنوش","مهرورز","مهریار","مهریار","مهوار","مهیار","مهیاز","مهیمن","موسی","میثاق","میثم","میعاد","میلاد","نادر","ناصر","نامدار","نامور","نامی","نریمان","نصرت","نصیر","نظام","نعمت","نوزر","نوید","نوین","نیرو","نیک","نیکا","نیکان","نیکاو","نیکروز","نیکزاد","نیکنام","نیما","نیماد","نیناد","نیوشا","نیوند","هاتف","هادی","هارون","هاشم","هامون","هدایت","هرمز","همایون","هوتن","هورداد","هوشنگ","هوشیار","هیراد","هیربد","وحید","وفا","وهاب","یاشار","یامین","یاور","یحیی","یزدان","یعقوب","یوسف","یونس","آبان","آتسا","آتنا","آتوسا","آتوشه","آذر","آذرخش","آذرداد","آذردخت","آذرمهر","آذرنوش","آذین","آرا","آرتا","آرزو","آرمان","آرمیتا","آرمیلا","آریان","آریانا","آزاده","آزیتا","آسام","آسمان","آسمانه","آسیه","آفاق","آفتاب","آفرین","آلاله","آلما","آمنه","آنا","آناهیتا","آنوش","آنیتا","آهو","آوا","آوین","آیتان","آیدا","آیدان","آیسا","آیلا","آیلین","ابریشم","احترام","اختر","ارستو","ارغوان","ارکیده","ارمغان","اشرف","اعظم","افتخار","افرا","افرند","افری","افسان","افسانه","افسر","افسون","افشان","افشانه","اکرم","الدوز","الفت","المیرا","الناز","الهام","الهه","الیا","الیزه","الیکا","امید","انسی","انسیه","انوشه","ایرسا","ایرسیا","ایلا","ایمان","باران","بنفشه","بهار","بهاره","بهتن","بهدخت","بهرخ","بهرو","بهناز","بهناک","بهنوش","بهین","بوران","پارمیس","پارمین","پاکنوش","پالیز","پانته آ","پانیذ","پدیده","پردیس","پرستو","پرند","پرنیا","پروا","پروانه","پروین","پری","پریا","پریچهر","پریزاد","پریسا","پریما","پریناز","پریوش","پژواک","پگاه","پوپک","پوپه","پوران","پوری","پیوند","تابا","تارا","تانیا","تبسم","ترانه","ترمه","تکتم","توران","تینا","ثریّا","ثمر","ثمن","جمیله","جهان","جیران","چکامه","چمن","حدیث","حسنا","حلیمه","حمیده","حمیرا","حنا","حورا","حوری","حوریه","خاتون","خاطره","خدیجه","خورشید","دانا","درسا","درنا","دریا","دل آرا","دلارام","دنیا","دیبا","دینا","راحله","راحیل","راستا","راشین","راضیه","راما","رامش","رامک","رامینا","راهله","راوک","رایکا","رباب","ربابه","رخساره","رخشان","رخند","رشاد","رشیا","رضوان","رعنا","رقیّه","رکسانا","رها","رودابه","روزچهر","روژینا","روشنا","روشنک","رومینا","رویا","ریحان","ریحانه","ریما","ریماز","زهرا","زهره","زیبا","زینب","ژاله","ژیلا","ژینا","ساحل","سارا","سارینا","ساغر","ساناز","ساویس","ساینا","سایه","سپنتا","سپهرم","سپیدا","سپیده","سپینود","ستوده","سحر","سحرناز","سرمه","سرور","سروناز","سروند","سعیده","سلما","سلماز","سلیمه","سمانه","سمن","سمناز","سمیرا","سمینه","سمیّه","سهیلا","سودابه","سورا","سوری","سوزان","سوسن","سوگلی","سوگند","سیما","سیمین","سیوا","شاپرک","شادان","شادمان","شادی","شایسته","شبنم","شراره","شرمین","شروین","شریفه","شعله","شقایق","شکوفه","شکیبا","شمس","شمسی","شمیا","شمیم","شمین","شهرزاد","شهرناز","شهره","شهرود","شهلا","شهناز","شهنواز","شهین","شوکت","شیرین","شیفته","شیما","شیوا","شیوه","صبا","صدف","صدیقه","صفا","صفورا","صفیّه","صنم","صنوبر","طاهره","طلعت","طناز","طوبی","طوفان","طیبه","ظریف","عادله","عاطفه","عالیه","عزیز","عسل","عصمت","عفت","غزال","غزاله","غنچه","فائزه","فاطمه","فتّانه","فخری","فرانک","فرح","فرحناز","فردوس","فرزانه","فرشته","فرناز","فرنیا","فروغ","فریا","فریبا","فریده","فریما","فهیمه","فیروزه","قمر","کاملیا","کبری","کتایون","کرشمه","کژال","کمند","کوکب","کیانا","کیدرا","کیمیا","کیهان","گلاره","گلبانو","گلبرگ","گلپری","گلچهره","گلرخ","گلرنگ","گلرو","گلشن","گلشیفته","گلگون","گلمهر","گلنار","گلناز","گلی","گوهر","گوهرشاد","گیتا","گیتی","گیسو","گیسی","گیلدا","لادن","لاله","لطیفه","لعیا","لیان","لیدا","لیلا","لیلا","لیلی","لیما","لینا","مائده","مارال","ماریه","مامک","مانا","ماندا","ماندیس","مانلی","مانی","مانیا","ماهدخت","ماهرخ","ماهرو","محبوبه","محیا","مدینه","مرجان","مرسده","مرضیه","مرمر","مریم","مژده","مستانه","مستوره","معصومه","ملیح","ملیحه","ملیسا","ملیکا","منصوره","منظر","منیر","منیره","منیژه","مه سیما","مها","مهتاب","مهتاج","مهدخت","مهدیس","مهرآسا","مهرآفرین","مهرا","مهران","مهرانه","مهراوه","مهربانو","مهرخ","مهرزاد","مهرسا","مهرشید","مهرناز","مهرنوش","مهروش","مهری","مهزاد","مهسا","مهسان","مهستی","مهشاد","مهشید","مهکامه","مهلا","مهلقا","مهناز","مهنوش","مهین","مهین بانو","مهیندخت","مونا","میترا","میثاق","میشا","مینا","مینو","میهن","ناجی","نادی","نادیا","نارین","ناز","نازآفرین","نازبانو","نازبو","نازگل","نازنین","نازی","ناهید","نجمه","نجوی","ندا","نرجس","نرگس","نسا","نسترن","نسرین","نسیم","نشاط","نغمه","نفیسه","نگار","نگاه","نگین","نهال","نوا","نورا","نورانگیز","نوژان","نوشآفرین","نوشا","نوشین","نوگل","نوین","نیاز","نیّره","نیسا","نیکا","نیکدخت","نیکدل","نیکناز","نیکی","نیلوفر","نیوشا","نیوشه","هاله","هانا","هاني","هانيه","هایده","هدیه","هستی","هلاله","هما","هنگامه","هوردخت","هیلدا","هیوا","واژه","وجیهه","ورنا","وستا","وشتی","وصال","وندا","ویس","ویستا","ویشکا","یاس","یاسمن","یاسمین","یاقوت","یزدانه","یکتا","یگانه","یلدا"];
        $lastName = ["آدینه","آریان‌پور","آشتیانی","آشنا","آشوری","آهنگر","آهنگری","آژند","آیت‌اللهی","ابتکار","ابریشمی","ابطحی","ابوذر","ادیانی","ارسباران","استادی","اشتری","اشراقی","اصفهانی","اصلانی","افخمی","امانت","امانی","امیری","امین‌زاده","انتظامی","انوری","انوشه","ایمانی","باستانی","باطنی","باغچه‌بان","باهنر","بحرینی","بختیاری","بدخشانی","برزویی","بزرگی","بزرگیان","بهاور","بهبهانی","بهشتی","بیگی","پارسا","پارسی","پایا","پایدار","پایور","پناهی","پناهیان","پویان","پیران","پیرحیاتی","پیوندی","تبریزی","ترکاشوند","ترکان","تهرانی","توسلی","ثابتی","جعفریان","جنتی","جهانگیری","جهانی","چاوشی","حائری","حبیبی","حجتی","حسابی","حقانی","حقیقی","حکمت","حکیمی","حیاتی","خاتمی","خاموشی","خداپناهی","خدایی","خراسانی","خرم‌آبادی","خمسه","خوئینی","خیابانی","دانایی‌فر","داور","درگاهی","دستغیب","دهقان","ذاکری","راوندی","رجایی","رحماندوست","رحمانیان","رستمی","رسولی","رفیعی","رنجبر","رهنما","روحانی","روزبه","روستا","زارع","زرشناس","زمردیان","زنجانی","زهرایی","ساعی","سبحانی","سبزواری","ستاری","سحاب","سحابی","سراج","سرشار","سرمد","سروش","سلامت","سیف‌زاده","شاه‌حسینی","شبستری","شجاعی","شریعتمداری","شریعتی","شریف","شریفیان","شعبانی","شیدا","شیرازی","شیرمحمدی","شیروانی","کامکار","کاویانی","کاکاوند","کرمانی","کریمی","کمالی","کوشکی","کیان","کیانی","کیمیایی","گلپایگانی","گنجی","صانعی","صباغ","صدر","صدیق","صدیقی","صفوی","ضابطی","ضرغامی","طالب‌زاده","طالقانی","طباطبائی","طبیب‌زاده","طریقت","ظریف","عارف","عاشوری","عالی","عبادی","عبدالملکی","عبدالکریمی","عراقی","عزیزی","عصار","عقیلی","علم","علیا","علی‌آبادی","علی‌زمانی","علی‌پور","عنایت","غضنفری","غنی","فاطمی","فانی","فتاحی","فرامرزی","فرج","فرهنگ","فروتن","فریاد","فهمیده","فولادوند","قاضی","قانعی","قمیشی","قهرمان","قهرمانی","قهرمانیان","لاجوردی","لنکرانی","لوکس","مجاهد","مجتبایی","مجتهد","مجتهدی","مجرد","محجوب","محجوبی","محدثی","محمدرضایی","محمدی","مددی","مرادخانی","مرتضوی","مستوفی","مصاحب","مصباح","مصباح‌زاده","مطهری","مظفر","معارف","معروف","معین","مفتاح","مقدم","ملایری","ملکیان","منوچهری","مهاجرانی","مهدی‌پور","موحد","موسوی","موسویان","میرباقری","میردامادی","میرزاده","میرسپاسی","میزبانی","ناظری","نامور","نجفی","نراقی","نعمت‌زاده","نقدی","نقیب‌زاده","نهاوندی","نواب","نوبخت","نوبختی","نیشابوری","نیلوفری","هاشمی","هاشمی","هاشمیان","هامون","هدایت","هراتی","هروی","همایون","همت","همدانی","هوشیار","هومن","واثقی","واعظ","واعظی","واعظ‌زاده","یاحقی","یثربی"];
        $name = $firstName[array_rand($firstName)] .' '.$lastName[array_rand($lastName)] ;
        return $name;
    }

    public static function get_user_comments(){
        $user_comments = get_option( 'gzseo_user_comments', [] );
        if(! $user_comments) $user_comments = [];
        return $user_comments;


    }
    public function save_user_comments(){
        

        check_ajax_referer('gzseo_save_comments_nonce', 'nonce');

       
        // Verify and sanitize comments here
        if (!isset($_POST['comments'])) {
            delete_option( 'gzseo_user_comments' );
        }
        if(empty($_POST['comments'])){
            delete_option( 'gzseo_user_comments' );
        }else{
            //$posts = ;

            $posts =  map_deep( wp_unslash(  $_POST['comments'] ), 'sanitize_text_field' );
            //$posts = array_map('sanitize_text_field',array_map('wp_unslash',$_POST['comments']));

            
        }
        
        
        // Save comments logic
        
        update_option( 'gzseo_user_comments', $posts );

       // var_dump($comments);
        // Here you need to write your logic for saving the comments
        // For example, update options or save in the database
        // update_option('gzseo_comments', $comments);
    
        wp_send_json_success();
    }
    
}